Revit 2027 API
DuctSizeSettings.GetDuctSizeSettings Method
 Get the duct size settings of the project.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DuctSizeSettings GetDuctSizeSettings(
	Document aDoc
)
Public Shared Function GetDuctSizeSettings (
	aDoc As Document
) As DuctSizeSettings
public:
static DuctSizeSettings^ GetDuctSizeSettings(
	Document^ aDoc
)
static member GetDuctSizeSettings :
        aDoc : Document -> DuctSizeSettings
Parameters
aDoc Document
 The document.
Return Value
DuctSizeSettings
 The duct size settings of the project.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace